
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаСТоваром = Элементы.Товары.ТекущиеДанные;
	СтрокаСТоваром.СуммаНДС = ПолучитьСуммуНДС(СтрокаСТоваром.Цена * СтрокаСТоваром.Количество, ПолучитьСтавкуНДС());
	СтрокаСТоваром.СуммаПродажи = РасчетСуммы(СтрокаСТоваром.Цена, СтрокаСТоваром.Количество);
КонецПроцедуры


Функция РасчетСуммы(Цена, Количество)
	Сумма = Цена * Количество;
	СуммаНДС = ПолучитьСуммуНДС(Сумма, ПолучитьСтавкуНДС());
	Возврат Сумма + СуммаНДС;
КонецФункции

Функция ПолучитьСуммуНДС(Сумма, СтавкаНДС)
	Возврат Сумма / 100 * СтавкаНДС;
КонецФункции

Функция ПолучитьСтавкуНДС()
	Возврат Константы.СтавкаНДС.Получить();
КонецФункции	


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаСТоваром = Элементы.Товары.ТекущиеДанные;
	СтрокаСТоваром.СуммаНДС = ПолучитьСуммуНДС(СтрокаСТоваром.Цена * СтрокаСТоваром.Количество, ПолучитьСтавкуНДС());
	СтрокаСТоваром.СуммаПродажи = РасчетСуммы(СтрокаСТоваром.Цена, СтрокаСТоваром.Количество);
КонецПроцедуры

